<?php
/***
Задача:
Дан массив из 100 элементов. 
Требуется вывести количество последовательных пар одинаковых элементов.
Например: 1, 1, 2, 3, 4 -51, 12, 12, 12, -51
***/

function countCon($data, $n){

    $count = 0;  

    for ($i = 0; $i < $n - 1; $i++){
        // Если последовательные элементы одинаковы
        if ($data[$i] == $data[$i + 1]) $count++;
    }

    return $count;

}
  

// $arr = array(1, 2, 2, 3, 4, 4, 5, 5, 5, 5);
$arr = array(1, 1, 2, 3, 4 -51, 12, 12, 12, -51);

$n = count($arr);

echo countCon($arr, $n);
?>